### EDA을 위한 다양한 pandas function 연습  
---
참고링크 : https://pandas.pydata.org/docs/user_guide/10min.html

In [1]:
import numpy as np
import pandas as pd

series and dataFrame 을 만들어 보고, 차이점을 기억해 두자
series 1차 배열
dataFrame 2차 배열

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.845375 -0.935786 -0.044529  1.747974
2013-01-02 -1.019355  1.622628 -1.404679  1.399024
2013-01-03  1.170815  0.261202 -0.858285  0.038963
2013-01-04  1.317652 -0.222604 -0.231454  0.149534
2013-01-05 -0.525389 -1.575649 -0.750594 -0.959417
2013-01-06  0.818168  0.350317 -0.176875 -0.967263

In [157]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2 
# df2[:]
# df2[:][:]
# df2.loc[:,:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
# df.head()
# df.tail()
# df.index
# df.columns
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.152753 -0.083315 -0.577736  0.234803
std    1.064536  1.112667  0.521025  1.145587
min   -1.019355 -1.575649 -1.404679 -0.967263
25%   -0.765378 -0.757490 -0.831362 -0.709822
50%    0.146389  0.019299 -0.491024  0.094249
75%    1.082653  0.328038 -0.190520  1.086652
max    1.317652  1.622628 -0.044529  1.747974

In [10]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.845375   -1.019355    1.170815    1.317652   -0.525389    0.818168
B   -0.935786    1.622628    0.261202   -0.222604   -1.575649    0.350317
C   -0.044529   -1.404679   -0.858285   -0.231454   -0.750594   -0.176875
D    1.747974    1.399024    0.038963    0.149534   -0.959417   -0.967263

In [9]:
df.to_numpy()

array([[-0.84537475, -0.93578579, -0.04452938,  1.74797387],
       [-1.01935511,  1.62262776, -1.40467926,  1.39902408],
       [ 1.17081474,  0.26120216, -0.85828538,  0.03896345],
       [ 1.31765175, -0.22260355, -0.23145417,  0.14953443],
       [-0.52538944, -1.57564928, -0.75059364, -0.95941747],
       [ 0.81816785,  0.35031655, -0.17687501, -0.96726296]])

### Selection
---
[]  
loc (or at)  
iloc (or iat)

In [145]:
df['A']
# df[:]['A']       #df.loc[:,'A']
# df['2013-01-01':]['A']  
# df.A
# df[['A','C']]    # dataFrame 리턴


## column 을 선택하게 되며 series 로 리턴된다.

2013-01-01   -0.845375
2013-01-02   -1.019355
2013-01-03    1.170815
2013-01-04    1.317652
2013-01-05   -0.525389
2013-01-06    0.818168
Freq: D, Name: A, dtype: float64

In [149]:
# df[0:3]
# df['2013-01-01':'2013-01-03']
# df['2013-01-04':]
df[3:]

# row 을 선택하게 되며, dataFrame 으로 리턴된다

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [150]:
df2[2:4]['A']

2    1.0
3    1.0
Name: A, dtype: float64

In [153]:
#chained indexing?

df[2:4][0:4]
df2[2:4][0:1]

     A          B    C  D     E    F
2  1.0 2013-01-02  1.0  3  test  foo

---

In [154]:
# df.loc['20130101']
df2.loc[:,'A']

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [155]:
df.loc[:,:]

                   A         B         C         D
2013-01-01 -0.845375 -0.935786 -0.044529  1.747974
2013-01-02 -1.019355  1.622628 -1.404679  1.399024
2013-01-03  1.170815  0.261202 -0.858285  0.038963
2013-01-04  1.317652 -0.222604 -0.231454  0.149534
2013-01-05 -0.525389 -1.575649 -0.750594 -0.959417
2013-01-06  0.818168  0.350317 -0.176875 -0.967263